/* Encoding names. Some of these are are taken from a system file:
   /System/Library/Frameworks/CoreServices.framework/Frameworks/CarbonCore.framework/Resources/*.lproj/TextEncodingNames.string
   where * corresponds to one of multiple possible languages.
*/


/* "MacOSRoman" corresponds to code 0x00010000 in TextEncodingNames.string */
"MacOSRoman"	= "Western (Mac OS Roman)";

/* "IsoLatin" corresponds to code 0x00000201 in TextEncodingNames.string */
"IsoLatin"	= "Western (ISO Latin 1)";

/* "IsoLatin2" corresponds to code 0x00000202 in TextEncodingNames.string */
"IsoLatin2"	= "Central European (ISO Latin 2)";

/* "IsoLatin5" corresponds to code 0x00000209 in TextEncodingNames.string */
"IsoLatin5"	= "Turkish (ISO Latin 5)";

/* "IsoLatin9" corresponds to code 0x0000020F in TextEncodingNames.string */
"IsoLatin9"	= "Western (ISO Latin 9)";

/* "IsoLatinGreek" corresponds to code 0x00000207 in TextEncodingNames.string */
"IsoLatinGreek"	= "Greek (ISO 8859-7)";

/* "Mac Central European Roman" corresponds to code 0x00000029 in TextEncodingNames.string */
"Mac Central European Roman" = "Mac Central European Roman";

/* "MacJapanese" corresponds to code 0x00000001 in TextEncodingNames.string */
"MacJapanese"	= "Japanese (Mac OS, ShiftJIS ¥)";

/* "DOSJapanese" corresponds to code 0x00000420 in TextEncodingNames.string */
"DOSJapanese"	= "Japanese (Windows, DOS, ShiftJIS \)";

/* "SJIS_X0213" corresponds to code 0x00000628 in TextEncodingNames.string */
"SJIS_X0213"	= "Japanese (Shift JIS X0213)";

/* "EUC_JP" corresponds to code 0x00000920 in TextEncodingNames.string */
"EUC_JP"	= "Japanese (EUC)";

/* "JISJapanese" corresponds to code 0x00000820 in TextEncodingNames.string */
"JISJapanese"	= "Japanese (ISO 2022-JP)";

/* "MacKorean" corresponds to code 0x00000003 in TextEncodingNames.string */
"MacKorean"	= "Korean (Mac OS)";

/* "UTF-8 Unicode" corresponds to code 0x08000100 in TextEncodingNames.string */
"UTF-8 Unicode"	= "Unicode (UTF-8)";

/* "Standard Unicode" corresponds to code 0x00000100 in TextEncodingNames.string */
"Standard Unicode"	= "Unicode (UTF-16)";

/* "Mac Cyrillic" corresponds to code 0x00010007 in TextEncodingNames.string */
"Mac Cyrillic"	= "Cyrillic (Mac OS)";

/* "DOS Cyrillic" corresponds to code 0x00000413 in TextEncodingNames.string */
"DOS Cyrillic"	= "Cyrillic (DOS)";

/* "DOS Russian" corresponds to code 0x0000041b in TextEncodingNames.string */
"DOS Russian"	= "Russian (DOS)";

/* "Windows Latin 1" corresponds to code 0x00000500 in TextEncodingNames.string */
"Windows Latin 1" = "Windows Latin 1";

/* "WindowsCentralEurRoman" corresponds to code 0x00000501 in TextEncodingNames.string */
"WindowsCentralEurRoman" = "Central European Roman (Windows)";

/* "Windows Cyrillic" corresponds to code 0x00000502 in TextEncodingNames.string */
"Windows Cyrillic"	= "Cyrillic (Windows)";

/* "KOI8_R" corresponds to code 0x00000a02 in TextEncodingNames.string */
"KOI8_R"	= "Russian (KOI8-R)";

/* "Mac Chinese Traditional" corresponds to code 0x00000002 in TextEncodingNames.string */
"Mac Chinese Traditional"	= "Traditional Chinese (Mac OS)";

/* "Mac Chinese Simplified" corresponds to code 0x00000019 in TextEncodingNames.string */
"Mac Chinese Simplified"	= "Simplified Chinese (Mac OS)";

/* "DOS Chinese Traditional" corresponds to code 0x00000423 in TextEncodingNames.string */
"DOS Chinese Traditional"	= "Traditional Chinese (Windows, DOS)";

/* "DOS Chinese Simplified" corresponds to code 0x00000421 in TextEncodingNames.string */
"DOS Chinese Simplified"	= "Simplified Chinese (Windows, DOS)";

/* "GBK" corresponds to code 0x00000631 in TextEncodingNames.string */
"GBK"	= "Chinese (GBK)";

/* "GB 2312" corresponds to code 0x00000630 in TextEncodingNames.string */
"GB 2312"	= "Simplified Chinese (GB 2312)";

/* "GB 18030" corresponds to code 0x00000632 in TextEncodingNames.string */
"GB 18030"	= "Chinese (GB 18030)";
